app/Controllers/Materials.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function upload($course_id = null)
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $userRole = session()->get('user_role');
        $userId = session()->get('user_id');

        // Validate course_id
        if (!$course_id) {
            return redirect()->back()->with('error', 'Course ID is required.');
        }

        // Check if course exists
        $course = $this->courseModel->find($course_id);

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function delete($material_id = null)
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $userRole = session()->get('user_role');
        $userId = session()->get('user_id');

        // Validate material_id
        if (!$material_id) {
            return redirect()->back()->with('error', 'Material ID is required.');
        }

        // Get material information
        $material = $this->materialModel->getMaterialById($material_id);
        if (!$material) {
            return redirect()->back()->with('error', 'Material not found.');
        }

        // Get course information
        $course = $this->courseModel->find($material['course_id']);

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function list($course_id = null)
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $userRole = session()->get('user_role');
        $userId = session()->get('user_id');

        // Validate course_id
        if (!$course_id) {
            return redirect()->back()->with('error', 'Course ID is required.');
        }

        // Get course information
        $course = $this->courseModel->find($course_id);