app/Models/MaterialModel.php

    public function insertMaterial($data)
    {
        // Validate required fields
        if (!isset($data['course_id']) || !isset($data['file_name']) || !isset($data['file_path'])) {
            log_message('error', 'MaterialModel: Missing required fields in insertMaterial');
            return false;
        }

        // Prepare data for insertion
        $insertData = [
            'course_id' => (int) $data['course_id'],
            'file_name' => $data['file_name'],
            'file_path' => $data['file_path'],
            'created_at' => date('Y-m-d H:i:s')
        ];

        // Skip validation completely for this insert
        $this->skipValidation = true;

        try {
            // Insert the record
            $result = $this->insert($insertData);
---
INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `created_at`) VALUES (1, 'sub.jpeg', 'uploads/materials/1761416835_dd8ae67a41a0bc786d28.jpeg', '2025-10-25 18:27:15')

    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '1'
ORDER BY `created_at` DESC

    public function getMaterialById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `materials`
WHERE `materials`.`id` = '2'

    public function deleteMaterial($id)
    {
        return $this->delete($id);
---
DELETE FROM `materials`
WHERE `id` IN ('2')